In [1]:
import numpy as np
import pandas as pd

# Version of pandas

In [2]:
pd.__version__

'2.0.1'

# working with pandas

## A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type.
# a. creating Series

## series through list

In [3]:
l=[1,2,3,4,4]
l

[1, 2, 3, 4, 4]

In [4]:
pd.Series(l)

0    1
1    2
2    3
3    4
4    4
dtype: int64

## series through numpy

In [9]:
arr=np.arange(15)
print(arr)
seri=pd.Series(arr)
seri

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14]

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
dtype: int32

## given index

In [13]:
seri=pd.Series(index=['A',"v",'c','b'],data=[1,2,3,4])

seri

A    1
v    2
c    3
b    4
dtype: int64

Series thorugh Dictionary

In [15]:
seri=pd.Series({1:'a',2:'b',3:'c'})
seri

1    a
2    b
3    c
dtype: object

## Series through  repeat()

In [21]:
pd.Series(5).repeat(9)

0    5
0    5
0    5
0    5
0    5
0    5
0    5
0    5
0    5
dtype: int64

In [23]:
pd.Series([10,1]).repeat([5,2]).reset_index(drop=1)

0    10
1    10
2    10
3    10
4    10
5     1
6     1
dtype: int64

reset_index()

In [19]:
pd.Series(9).repeat(6).reset_index()

   index  0
0      0  9
1      0  9
2      0  9
3      0  9
4      0  9
5      0  9

In [26]:
arr=pd.Series(9).repeat(6).reset_index(drop=1)
arr

0    9
1    9
2    9
3    9
4    9
5    9
dtype: int64

Accessing elements

In [28]:
arr[4:]

4    9
5    9
dtype: int64

 # b). Aggregat functions

In [30]:
seri=pd.Series([1,2,3,4,5,6])
seri.agg([max,min,sum])

max     6
min     1
sum    21
dtype: int64

# c). absulot function

In [31]:
seri=pd.Series([1,2,-3,4,-5,6])
seri.abs()

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

# d). join or concat two or more series

In [45]:
seri1=pd.Series([1,2,3,4,5,6])
seri2=pd.Series([1,2,-3,4,-5,6])
# seri1.append(seri2)
pd.concat([seri2,seri1,seri2])

0    1
1    2
2   -3
3    4
4   -5
5    6
0    1
1    2
2    3
3    4
4    5
5    6
0    1
1    2
2   -3
3    4
4   -5
5    6
dtype: int64

## g). All string function 

    upper and lower function
    len function
    strip function
    split function
    contains function
    replace function
    conut funtion
    startswith and endswith function
    find finciton

In [46]:
seri=pd.Series(['Allu',"Bhallu","tuto gayo","jangul me nach Mor kisne Dakha","char Botal papseee"])

### upper and lower function

In [50]:
seri.str.upper()

0                              ALLU
1                            BHALLU
2                         TUTO GAYO
3    JANGUL ME NACH MOR KISNE DAKHA
4                CHAR BOTAL PAPSEEE
dtype: object

In [51]:
seri.str.lower()

0                              allu
1                            bhallu
2                         tuto gayo
3    jangul me nach mor kisne dakha
4                char botal papseee
dtype: object

In [52]:
seri

0                              Allu
1                            Bhallu
2                         tuto gayo
3    jangul me nach Mor kisne Dakha
4                char Botal papseee
dtype: object

### len function

In [55]:
for i in seri:
    print("len of",i,"is => ",len(i))

len of Allu is =>  4
len of Bhallu is =>  6
len of tuto gayo is =>  9
len of jangul me nach Mor kisne Dakha is =>  30
len of char Botal papseee is =>  18

### strip function

In [62]:
seri.str.strip()
for i in seri:
    print("len of",i,"is => ",len(i))

len of Allu is =>  4
len of Bhallu is =>  6
len of tuto gayo is =>  9
len of jangul me nach Mor kisne Dakha is =>  30
len of char Botal papseee is =>  18

### split function

In [72]:
seri.str.split()

0                                   [Allu]
1                                 [Bhallu]
2                             [tuto, gayo]
3    [jangul, me, nach, Mor, kisne, Dakha]
4                   [char, Botal, papseee]
dtype: object

### contains function

In [73]:
seri.str.contains('A')

0     True
1    False
2    False
3    False
4    False
dtype: bool

### replace function

In [82]:
seri=seri.str.replace("A","Ca")
seri

0                             Callu
1                            Bhallu
2                         tuto gayo
3    jangul me nach Mor kisne Dakha
4                char Botal papseee
dtype: object

### conut funtion

In [83]:
seri.str.count('a')

0    1
1    1
2    1
3    4
4    3
dtype: int64

### startswith and endswith function

In [84]:
seri.str.startswith('C')

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [85]:
seri.str.endswith("e")

0    False
1    False
2    False
3    False
4     True
dtype: bool

### find finciton

In [88]:
print(seri)
seri.str.find('B')

0                             Callu
1                            Bhallu
2                         tuto gayo
3    jangul me nach Mor kisne Dakha
4                char Botal papseee
dtype: object

0   -1
1    0
2   -1
3   -1
4    5
dtype: int64

 # h). Converting Series to list

In [94]:
seri.to_list()

['Callu',
 'Bhallu',
 'tuto gayo',
 'jangul me nach Mor kisne Dakha',
 'char Botal papseee']

In [93]:
type(seri.to_list())

list

 <h1 style="color:green;font-size:40px;">2.Detailed coding implementations on pandas DataFrame

# a). Creating Data Frames

## -> creating a dataframe using list

In [95]:
lst=[1,2,3,4,5,6]
pd.DataFrame(lst)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [96]:
lst=[[1,0],[11,78],[47,75]]
pd.DataFrame(lst)

    0   1
0   1   0
1  11  78
2  47  75

## creating using dicnary

In [101]:
data={'name':['a','b','c'],'id':[1,2,3]}
pd.DataFrame(data)

  name  id
0    a   1
1    b   2
2    c   3

In [105]:
data={"name":['aa','bb'],'id':[1,2],'address':[35400,4584],"qualification":['bca','mca']}
df=pd.DataFrame(data)

In [106]:
df[["name",'id','address']]

  name  id  address
0   aa   1    35400
1   bb   2     4584

## b) slicing in dataframes using iloc and loc

In [107]:
df

  name  id  address qualification
0   aa   1    35400           bca
1   bb   2     4584           mca

In [115]:
df.loc[1:,'id':"qualification"]

   id  address qualification
1   2     4584           mca

In [116]:
df.iloc[1:,1:]

   id  address qualification
1   2     4584           mca

adding new column

In [120]:
l=[1,2]
df['new']=l

In [119]:
df

  name  id  address qualification  new
0   aa   1    35400           bca    1
1   bb   2     4584           mca    2

d) deleting column

In [121]:
del df['new']

In [122]:
df

  name  id  address qualification
0   aa   1    35400           bca
1   bb   2     4584           mca

In [123]:
df.pop('id')

0    1
1    2
Name: id, dtype: int64

In [124]:
df

  name  address qualification
0   aa    35400           bca
1   bb     4584           mca

Addintion of row

In [129]:
pd.concat([df,df])

  name  address qualification
0   aa    35400           bca
1   bb     4584           mca
0   aa    35400           bca
1   bb     4584           mca

In [240]:
data={'one':(np.arange(0,5)),
      'two':(np.arange(0,50,10)),
      'three':(np.arange(0,500,100)),
      'four':(np.arange(0,5000,1000)),  
     }
df=pd.DataFrame(data)

In [172]:
df=df.drop(0)

In [173]:
df

   one  two  three  four
1    1   10    100  1000
2    2   20    200  2000
3    3   30    300  3000
4    4   40    400  4000

In [175]:
df.drop(['one','two'],axis=1)

   three  four
1    100  1000
2    200  2000
3    300  3000
4    400  4000

Transport dataframe

In [176]:
df.T

          1     2     3     4
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

In [177]:
# data farame functionaliti

In [178]:
df.axes

[RangeIndex(start=1, stop=5, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [179]:
df.ndim

2

In [181]:
df.dtypes

one      int32
two      int32
three    int32
four     int32
dtype: object

In [182]:
df.shape

(4, 4)

In [183]:
df

   one  two  three  four
1    1   10    100  1000
2    2   20    200  2000
3    3   30    300  3000
4    4   40    400  4000

In [184]:
df.head(2)

   one  two  three  four
1    1   10    100  1000
2    2   20    200  2000

In [187]:
df.tail(2)

   one  two  three  four
3    3   30    300  3000
4    4   40    400  4000

In [189]:
df.empty

False

In [190]:
# Statistical or mathmatical function

In [241]:
# sum
df

   one  two  three  four
0    0    0      0     0
1    1   10    100  1000
2    2   20    200  2000
3    3   30    300  3000
4    4   40    400  4000

In [192]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

In [194]:
# mean
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [195]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [242]:
df.loc[len(df.index)]=[4,40,400,5000]

In [222]:
df['two'].mode()

0    10
1    20
2    30
3    40
Name: two, dtype: int32

In [226]:
de=pd.DataFrame({"a":[1,2,3,45,6,4,5,4,5,5,5,5,4],'b':[1,4,4,2,3,45,6,4,5,4,5,5,4]})

In [227]:
de['a'].mode()

0    5
Name: a, dtype: int64

In [243]:
df.loc[len(df)]=[5,40,500,5000]

In [244]:
df

   one  two  three  four
0    0    0      0     0
1    1   10    100  1000
2    2   20    200  2000
3    3   30    300  3000
4    4   40    400  4000
5    4   40    400  5000
6    5   40    500  5000

In [237]:
dict = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }

df = pd.DataFrame(dict)

display(df)

df.loc[len(df.index)] = ['Amy', 89, 93] 

display(df)

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     89       93

In [245]:
df.max()

one         5
two        40
three     500
four     5000
dtype: int64

In [246]:
df.std()

one         1.799471
two        16.183472
three     179.947082
four     1951.800146
dtype: float64

In [247]:
df

   one  two  three  four
0    0    0      0     0
1    1   10    100  1000
2    2   20    200  2000
3    3   30    300  3000
4    4   40    400  4000
5    4   40    400  5000
6    5   40    500  5000

In [248]:
df.describe()

            one        two       three         four
count  7.000000   7.000000    7.000000     7.000000
mean   2.714286  25.714286  271.428571  2857.142857
std    1.799471  16.183472  179.947082  1951.800146
min    0.000000   0.000000    0.000000     0.000000
25%    1.500000  15.000000  150.000000  1500.000000
50%    3.000000  30.000000  300.000000  3000.000000
75%    4.000000  40.000000  400.000000  4500.000000
max    5.000000  40.000000  500.000000  5000.000000

In [250]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     7 non-null      int64
 1   two     7 non-null      int64
 2   three   7 non-null      int64
 3   four    7 non-null      int64
dtypes: int64(4)
memory usage: 280.0 bytes

In [251]:
# pipe function

In [253]:


def add_(i,j):
    return i+j
def sub_(i,j):
    return i-j

df

   one  two  three  four
0    0    0      0     0
1    1   10    100  1000
2    2   20    200  2000
3    3   30    300  3000
4    4   40    400  4000
5    4   40    400  5000
6    5   40    500  5000

In [254]:
df.pipe(add_,10)

   one  two  three  four
0   10   10     10    10
1   11   20    110  1010
2   12   30    210  2010
3   13   40    310  3010
4   14   50    410  4010
5   14   50    410  5010
6   15   50    510  5010

In [255]:
df.pipe(sub_,10)

   one  two  three  four
0  -10  -10    -10   -10
1   -9    0     90   990
2   -8   10    190  1990
3   -7   20    290  2990
4   -6   30    390  3990
5   -6   30    390  4990
6   -5   30    490  4990

In [256]:
def mean_(col):
    return col.mean()
df.pipe(mean_)

one         2.714286
two        25.714286
three     271.428571
four     2857.142857
dtype: float64

In [257]:
df.mean()

one         2.714286
two        25.714286
three     271.428571
four     2857.142857
dtype: float64

In [260]:
def square_(i):
    return i**2
df.pipe(square)

   one   two   three      four
0    0     0       0         0
1    1   100   10000   1000000
2    4   400   40000   4000000
3    9   900   90000   9000000
4   16  1600  160000  16000000
5   16  1600  160000  25000000
6   25  1600  250000  25000000

# apply function

In [264]:
df=df.drop(0)

In [265]:
df

   one  two  three  four
1    1   10    100  1000
2    2   20    200  2000
3    3   30    300  3000
4    4   40    400  4000
5    4   40    400  5000
6    5   40    500  5000

In [267]:
df.apply(lambda x: x.max()-x.min())

one         4
two        30
three     400
four     4000
dtype: int64

# applymap

In [292]:
def a(i):
    return i+2

df.apply(a)

   one  two  three  four
1    3   12    102  1002
2    4   22    202  2002
3    5   32    302  3002
4    6   42    402  4002
5    6   42    402  5002
6    7   42    502  5002

In [274]:
print(df)
df.applymap(np.int32)

   one  two  three  four
1    1   10    100  1000
2    2   20    200  2000
3    3   30    300  3000
4    4   40    400  4000
5    4   40    400  5000
6    5   40    500  5000

   one  two  three  four
1    1   10    100  1000
2    2   20    200  2000
3    3   30    300  3000
4    4   40    400  4000
5    4   40    400  5000
6    5   40    500  5000

In [282]:
df.apply(np.int32).dtypes

one      int32
two      int32
three    int32
four     int32
dtype: object

In [283]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [296]:
df

   one  two  three  four
1    1   10    100  1000
2    2   20    200  2000
3    3   30    300  3000
4    4   40    400  4000
5    4   40    400  5000
6    5   40    500  5000

In [304]:
df.rename(columns={'one':'a','two':'b','three':'c','four':'d'},inplace=True)

In [305]:
df

   a   b    c     d
1  1  10  100  1000
2  2  20  200  2000
3  3  30  300  3000
4  4  40  400  4000
5  4  40  400  5000
6  5  40  500  5000

# sorting in pandas DataFrame

In [306]:
df

   a   b    c     d
1  1  10  100  1000
2  2  20  200  2000
3  3  30  300  3000
4  4  40  400  4000
5  4  40  400  5000
6  5  40  500  5000

sort in scecific order

In [310]:
df.sort_values(by='a')

   a   b    c     d
1  1  10  100  1000
2  2  20  200  2000
3  3  30  300  3000
4  4  40  400  4000
5  4  40  400  5000
6  5  40  500  5000

In [311]:
df['e']=[2,5,7,8,45,48]

In [312]:
df

   a   b    c     d   e
1  1  10  100  1000   2
2  2  20  200  2000   5
3  3  30  300  3000   7
4  4  40  400  4000   8
5  4  40  400  5000  45
6  5  40  500  5000  48

In [313]:
df.sort_values(by='e')

   a   b    c     d   e
1  1  10  100  1000   2
2  2  20  200  2000   5
3  3  30  300  3000   7
4  4  40  400  4000   8
5  4  40  400  5000  45
6  5  40  500  5000  48

In [314]:
df.sort_values(by='e',ascending=False)

   a   b    c     d   e
6  5  40  500  5000  48
5  4  40  400  5000  45
4  4  40  400  4000   8
3  3  30  300  3000   7
2  2  20  200  2000   5
1  1  10  100  1000   2

In [315]:
df['f']=[1,45,74,24,4,6]
df.sort_values(by=['e','f'])

   a   b    c     d   e   f
1  1  10  100  1000   2   1
2  2  20  200  2000   5  45
3  3  30  300  3000   7  74
4  4  40  400  4000   8  24
5  4  40  400  5000  45   4
6  5  40  500  5000  48   6

In [316]:
df.sort_values(by=['e','f'],kind='healsort')

   a   b    c     d   e   f
1  1  10  100  1000   2   1
2  2  20  200  2000   5  45
3  3  30  300  3000   7  74
4  4  40  400  4000   8  24
5  4  40  400  5000  45   4
6  5  40  500  5000  48   6

# Groupby Functions

In [318]:
cricket={
    'team':['india','india','australia','sa','sa','sa','sa','nz','nz','nz','nz','india'],
    'rank':[2,3,1,2,3,4,1,1,2,4,1,2],
    'year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
    'pooints':[876,801,891,815,776,784,834,824,758,691,883,782]
}
df=pd.DataFrame(cricket)
df

         team  rank  year  pooints
0       india     2  2014      876
1       india     3  2015      801
2   australia     1  2014      891
3          sa     2  2015      815
4          sa     3  2014      776
5          sa     4  2015      784
6          sa     1  2016      834
7          nz     1  2017      824
8          nz     2  2016      758
9          nz     4  2014      691
10         nz     1  2015      883
11      india     2  2017      782

In [321]:
df.groupby('team').groups

{'australia': [2], 'india': [0, 1, 11], 'nz': [7, 8, 9, 10], 'sa': [3, 4, 5, 6]}

In [324]:
df.groupby(['team','year']).get_group(('india',2017))

     team  rank  year  pooints
11  india     2  2017      782

In [327]:
df.groupby('team').sum()['pooints']

team
australia     891
india        2459
nz           3156
sa           3209
Name: pooints, dtype: int64

In [328]:
df.groupby('team').sum()['pooints'].sort_values()

team
australia     891
india        2459
nz           3156
sa           3209
Name: pooints, dtype: int64

In [329]:
df.groupby('team').sum()['pooints'].sort_values(ascending=False)

team
sa           3209
nz           3156
india        2459
australia     891
Name: pooints, dtype: int64

In [332]:
g=df.groupby('team')
g['pooints'].agg([np.sum,np.mean,np.std,np.max,np.min])

            sum        mean        std  amax  amin
team
australia   891  891.000000        NaN   891   891
india      2459  819.666667  49.702448   876   782
nz         3156  789.000000  82.917630   883   691
sa         3209  802.250000  27.035471   834   776

In [333]:
df

         team  rank  year  pooints
0       india     2  2014      876
1       india     3  2015      801
2   australia     1  2014      891
3          sa     2  2015      815
4          sa     3  2014      776
5          sa     4  2015      784
6          sa     1  2016      834
7          nz     1  2017      824
8          nz     2  2016      758
9          nz     4  2014      691
10         nz     1  2015      883
11      india     2  2017      782

In [338]:
df.groupby('team').filter(lambda x: len(x)==4)

   team  rank  year  pooints
3    sa     2  2015      815
4    sa     3  2014      776
5    sa     4  2015      784
6    sa     1  2016      834
7    nz     1  2017      824
8    nz     2  2016      758
9    nz     4  2014      691
10   nz     1  2015      883

# <h1 style="color:blue;font-size:40px;font-family:'Freeform 721 Blk BT';">working with csv

In [339]:
#reading csv

In [340]:
df=pd.read_csv('Football.csv')
df

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,Netherlands,Eredivisie,(UTR),Gyrano Kerk,24,0,2155,10,7.49,0.33,50,18,2.20,0.79,2020
656,Netherlands,Eredivisie,(AJA),Quincy Promes,18,2,1573,12,9.77,0.59,56,30,3.38,1.81,2020
657,Netherlands,Eredivisie,(PSV),Denzel Dumfries,25,0,2363,7,5.72,0.23,45,14,1.81,0.56,2020
658,Netherlands,Eredivisie,NaN,Cyriel Dessers,26,0,2461,15,14.51,0.56,84,43,3.24,1.66,2020
659,Netherlands,Eredivisie,(PSV),Cody Gakpo,14,11,1557,7,4.43,0.27,38,15,2.32,0.92,2020

# Create DataFrame using link

In [346]:
link='https://www.stats.govt.nz/assets/Uploads/Annual-enterprise-survey/Annual-enterprise-survey-2021-financial-year-provisional/Download-data/annual-enterprise-survey-2021-financial-year-provisional-csv.csv'

In [349]:
data=pd.read_csv(link)
data.head(2)

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...

In [351]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41715 entries, 0 to 41714
Data columns (total 10 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Year                         41715 non-null  int64
 1   Industry_aggregation_NZSIOC  41715 non-null  object
 2   Industry_code_NZSIOC         41715 non-null  object
 3   Industry_name_NZSIOC         41715 non-null  object
 4   Units                        41715 non-null  object
 5   Variable_code                41715 non-null  object
 6   Variable_name                41715 non-null  object
 7   Variable_category            41715 non-null  object
 8   Value                        41715 non-null  object
 9   Industry_code_ANZSIC06       41715 non-null  object
dtypes: int64(1), object(9)
memory usage: 3.2+ MB

In [354]:
df.isnull().sum()

Country                     0
League                      0
Club                       34
Player Names                0
Matches_Played              0
Substitution                0
Mins                        0
Goals                       0
xG                          0
xG Per Avg Match            0
Shots                       0
OnTarget                    0
Shots Per Avg Match         0
On Target Per Avg Match     0
Year                        0
dtype: int64

In [361]:
df.describe(percentiles=[1])

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
100%,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000

In [362]:
fdt=df.copy()
fdt.head(2)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016

In [363]:
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [365]:
df['Player Names'].value_counts()

Player Names
Andrea Belotti     5
Lionel Messi       5
Luis Suarez        5
Andrej Kramaric    5
Ciro Immobile      5
                  ..
Francois Kamano    1
Lebo Mothiba       1
Gaetan Laborde     1
Falcao             1
Cody Gakpo         1
Name: count, Length: 444, dtype: int64

In [367]:
df['Player Names'].unique()

array(['Juanmi Callejon', 'Antoine Griezmann', 'Luis Suarez',
       'Ruben Castro', 'Kevin Gameiro', 'Cristiano Ronaldo',
       'Karim Benzema', 'Neymar ', 'Iago Aspas', 'Sergi Enrich',
       'Aduriz ', 'Sandro Ramlrez', 'Lionel Messi', 'Gerard Moreno',
       'Morata', 'Wissam Ben Yedder', 'Willian Jose', 'Andone ',
       'Cedric Bakambu', 'Isco', 'Mohamed Salah', 'Gregoire Defrel',
       'Ciro Immobile', 'Nikola Kalinic', 'Dries Mertens',
       'Alejandro Gomez', 'Jose CallejOn', 'Iago Falque',
       'Giovanni Simeone', 'Mauro Icardi', 'Diego Falcinelli',
       'Cyril Thereau', 'Edin Dzeko', 'Lorenzo Insigne',
       'Fabio Quagliarella', 'Borriello ', 'Carlos Bacca',
       'Gonzalo Higuain', 'Keita Balde', 'Andrea Belotti', 'Fin Bartels',
       'Lars Stindl', 'Serge Gnabry', 'Wagner ', 'Andrej Kramaric',
       'Florian Niederlechner', 'Robert Lewandowski', 'Emil Forsberg',
       'Timo Werner', 'Nils Petersen', 'Vedad Ibisevic', 'Mario Gomez',
       'Maximilian Philipp', 'A\x81dam Szalai',
       'Pierre-Emerick Aubameyang', 'Guido Burgstaller', 'Max Kruse',
       'Chicharito ', 'Anthony Modeste', 'Arjen Robben', 'Alexis Sanchez',
       'Romelu Lukaku', 'Harry Kane', 'Jamie Vardy', 'Christian Benteke',
       'Pedro None', 'Eden Hazard', 'Roberto Firmino', 'Sadio Mane',
       'Philippe Coutinho', 'Diego Costa', 'Dele Alli', 'Sergio Aguero',
       'Jermain Defoe', 'Fernando Llorente', 'Michail Antonio',
       'Zlatan Ibrahimovic', 'Olivier Giroud', 'Son Heung-Min',
       'Joshua King', 'Diego Souza', 'Pablo ', 'Robinho ', 'Kempes ',
       'Gabriel Jesus', 'Bruno Rangel ', 'Rogerio ', 'Vitor Bueno',
       'Marinho ', 'Grafite ', 'Andres Chavez', 'Cicero Semedo', 'Sassa',
       'Giorgian de Arrascaeta', 'Keno ', 'Fred ', 'Kleber Gladiador',
       'Pottker ', 'Jonathan Copete', 'Ricardo Oliveira',
       'Angel Rodriguez', 'Gareth Bale', 'Rodrigo None', 'Sergio Leon',
       'Maxi Gomez', 'Mikel Oyarzabal', 'Willian Josa', 'Simone Zaza',
       'Portu ', 'Cristhian Stuani', 'Santi Mina', 'Morales ', 'Munir ',
       'Jose Callejon', 'Sergej Milinkovic-Savic', 'Duvan Zapata',
       'Paulo Dybala', 'Mirco Antenucci', 'Luis Alberto',
       'Roberto Inglese', 'Josip Ilicic', 'Ivan Perisic',
       'Leonardo Pavoletti', 'Kevin Lasagna', 'Niclas Fullkrug',
       'Salomon Kalou', 'Thorgan Hazard', 'Jean-Kevin Augustin',
       'Sandro Wagner ', 'Leon Bailey', 'Daniel Didavi',
       'Alfred Finnbogason', 'Davie Selke', 'Mark Uth',
       'Michael Gregoritsch', 'Julian Brandt', 'Kevin Volland', 'Roger ',
       'Arthur Caike', 'Everton ', 'Hernanes ', 'Luiz Fernando',
       'Wellington Paulista', 'Santiago Trellez', 'Jo', 'Thiago Neves',
       'Bruno Henrique', 'Dudu ', 'Diego ', 'Lucca ', 'Henrique Dourado',
       'Andre', 'Edigar Junio ', 'Junior  Dutra', 'Jaime Mata',
       'Inaki Williams', 'Chimy Avila', 'Raul de Tomas', 'Pablo Sarabia',
       'Borja Iglesias', 'Jorge Molina', 'Charles', 'Arkadiusz Milik',
       'Mandzukic None', 'Andrea Petagna', 'Francesco Caputo',
       'Stephan El Shaarawy', 'Gervinho ', 'Krzysztof Piatek',
       'Alassane Plea', 'Kai Havertz', 'Luka Jovic', 'Ante Rebic',
       'Jadon Sancho', 'Ondrej Duda', 'Paco Alcacer', 'Benito Raman',
       'Wout Weghorst', 'Ishak Belfodil', 'Marco Reus',
       'Jean-Philippe Mateta', 'Sebastien Haller', 'Yussuf Poulsen',
       'Angel Di Maria', 'Remi Oudin', 'Nicolas Pepe', 'Emiliano Sala',
       'Jonathan Bamba', "M'Baye Niang", 'Edinson Cavani',
       'Stephane Bahoken', 'Max Gradel', 'Florian Thauvin',
       'Kylian Mbappe-Lottin', 'Wahbi Khazri', 'Falcao ',
       'Gaetan Laborde', 'Andy Delort', 'Moussa Dembele', 'Memphis Depay',
       'Lebo Mothiba', 'Francois Kamano', 'Luka Milivojevic',
       'Paul Pogba', 'Ashley Barnes', 'Glenn Murray', 'Richarlison ',
       'Callum Wilson', 'Gylfi Sigurdsson', 'Raheem Sterling',
       'Ayoze Perez', 'Alexandre Lacazette', 'Raul Jimenez',
       'Lucas Paqueta', 'Juan Cazares', 'Deyverson ', 'Leandro Damiao ',
       'Yago Pikachu', 'Rodrygo ', 'Andres Rios', 'Roger Guedes ',
       'Leandro Pereira ', 'Pedro ', 'Nico Lupez', 'Nene ', 'Gilberto ',
       'Henrique ', 'Willian ', 'Gabriel Barbosa', 'Diego Rossi',
       'Josef Martinez', 'Chris Wondolowski', 'Nani ', 'Kacper Przybylko',
       'Kei Kamara', 'C.J. Sapong', 'Gyasi Zardes', 'Heber ',
       'Mauro Manotas', 'Brian Fernandez', 'Alejandro Pozuelo',
       'Felipe Gutierrez', 'Jordan Morris', 'Raul Ruidiaz',
       'Jozy Altidore', 'Carlos Vela', 'Nemanja Nikolic',
       'Alexandru Mitrita', 'Joselu', 'Carlos Fernandez', 'Ante Budimir',
       'Lucas Perez', 'Loren Moron', 'Raul Garcla', 'Morata ',
       'Sergio Ramos', 'Lucas Ocampos', 'Cazorla ', 'Pote ',
       'Tiquinho Soares', 'Eduardo Mancha', 'Paulinho ', 'Alex Telles',
       'Bruno Viana', 'Mehrdad Mohammadi', 'Carlos Valenzuela',
       'Ruben Lameiras', 'Moussa Marega', 'Gian-Luca Waldschmidt',
       'Samuel Lino', 'Andre Andre', 'Mehdi Taremi', 'Carlos Vinicius',
       'Sergio Oliveira', 'Douglas Tanque', 'Fabio Abreu',
       'Brayan Riascos', 'Alex Telles ', 'Fabio Martins',
       'Haris  Seferovic', 'Joao Teixeira', 'Bruno Fernandes',
       'Angel Gomes', 'Toni Mart\xadnez', 'Pizzi ', 'Bozhidar Kraev',
       'Sandro Lima', 'Rodrigo Pinho', 'Thiago Santana', 'Trincao ',
       'Andraz Sporar', 'Ricardo Horta', 'Bruno Duarte', 'Nuno Santos',
       'Domenico Berardi', 'Joao Pedro', 'Andreas Cornelius',
       'Marco Mancosu', 'Lautaro Martrinez', 'Luis Muriel',
       'Gianluca Lapadula', 'Marcus Thuram', 'Rouwen Hennings',
       'Andre Silva', 'Erling Haaland', 'Jhon Cordoba', 'Robin Quaison',
       'Sebastian Andersson', 'Dimitri Payet', 'Kasper Dolberg',
       'Adrien Thomasson', 'Dario Benedetto', 'Ludovic Ajorque',
       'Islam Slimani', 'Adrien Hunou', 'Denis Bouanga',
       'Sehrou Guirassy', '\x81ngel Di Maria', 'Habib Diallo',
       'Victor Osimhen', 'Dominic Calvert-Lewin', 'Kevin De Bruyne',
       'Chris Wood', 'Anthony Martial', 'Riyad Mahrez', 'Marcus Rashford',
       'Danny Ings', 'Richarlison  ', 'Teemu Pukki', 'Tammy Abraham',
       'Thiago Galhardo', 'Paolo Guerrero', 'Pepe', 'Michael ',
       'Carlos Sanchez', 'Everaldo ', 'Artur ', 'Marcelo  Cirino',
       'Yeferson Soteldo', 'Eduardo Sasha', 'Rafael Moura', 'Antony None',
       'Quincy Promes', 'Dusan Tadic', 'Armando Broja', 'Steven Berghuis',
       'Michael de Leeuw', 'Lois Openda', 'Danilo Nome', 'Lennart Thy',
       'Donyell Malen', 'Noni Madueke', 'Davy Klaassen',
       'Oussama Tannane', 'Vaclav Cerny', 'Vangelis Pavlidis',
       'Henk Veerman', 'Abdou Harroui', 'Rai Vloet', 'Lassina Traore',
       'Georgios Giakoumakis', 'Alex Pozuelo', 'Kevin Molino',
       'Damir Kreilach', 'Bradley Wright-Phillips', 'Nicolas Lodeiro',
       'Daryl Dike', 'Cristian Pavon', 'Chris Mueller', 'Romell Quioto',
       'Gustavo Bou', 'Robert Beric', 'Ayo Akinola', 'Jeremy Ebobisse',
       'Diego Valeri', 'Youssef   En-Nesyri', 'Carlos Soler',
       'Cristian Tello', 'Esteban Burgos', 'Joao Felix',
       'Federico Valverde', 'Kike GarcIa', 'Ansu Fati', 'Roberto Soriano',
       'Gaetano Castrovilli', 'Henrikh Mkhitaryan', 'Jordan Veretout',
       'Lautaro MartInez', 'Hirving Lozano', 'Lucas Alario', 'Bas Dost',
       'Dani Olmo', 'Ellyes Skhiri', 'Thomas Muller', 'Andre Hahn',
       'Daniel Caligiuri', 'Matheus Cunha', 'Ludovic Blas', 'Karl Toko',
       'Burak Yilmaz', 'Ibrahima Niane', 'Boulaye Dia', 'Moise Kean',
       'Ignatius Ganago', 'Irvin Cardona', 'Wissam Ben', 'Amine Gouiri',
       'Mama Balde', 'Gael Kakuta', 'James Ward-Prowse', 'Diogo Jota',
       'Wilfried Zaha', 'Jack Grealish', 'Jarrod Bowen',
       'Patrick Bamford', 'Danny Ings ', 'Neal Maupay', 'Ollie Watkins',
       'Luciano ', 'Vinicius ', 'Raphael Veiga', 'Luiz Adriano',
       'Cleber ', 'German Cano', 'Brenner None', 'Matheus Babi',
       'Alerrandro ', 'Claudinho ', 'Robson', 'Renato Kayzer',
       'Donny van de Beek', 'Teun Koopmeiners', 'Cantalapiedra ',
       'Bryan Linssen', 'Matavz ', 'Oussama Idrissi', 'Chidera Ejuke',
       'Myron Boadu', 'Klaas-Jan Huntelaar', 'Haris Vuckic',
       'Gyrano Kerk', 'Denzel Dumfries', 'Cyriel Dessers ', 'Cody Gakpo'],
      dtype=object)

In [368]:
df['Player Names'].nunique()

444

In [369]:
data.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...

In [371]:
data.isnull().sum()

Year                           0
Industry_aggregation_NZSIOC    0
Industry_code_NZSIOC           0
Industry_name_NZSIOC           0
Units                          0
Variable_code                  0
Variable_name                  0
Variable_category              0
Value                          0
Industry_code_ANZSIC06         0
dtype: int64

In [370]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41715 entries, 0 to 41714
Data columns (total 10 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Year                         41715 non-null  int64
 1   Industry_aggregation_NZSIOC  41715 non-null  object
 2   Industry_code_NZSIOC         41715 non-null  object
 3   Industry_name_NZSIOC         41715 non-null  object
 4   Units                        41715 non-null  object
 5   Variable_code                41715 non-null  object
 6   Variable_name                41715 non-null  object
 7   Variable_category            41715 non-null  object
 8   Value                        41715 non-null  object
 9   Industry_code_ANZSIC06       41715 non-null  object
dtypes: int64(1), object(9)
memory usage: 3.2+ MB

In [376]:
df.dropna(inplace=True)

In [377]:
df

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
654,Netherlands,Eredivisie,(RZA),Haris Vuckic,23,2,2194,11,6.00,0.26,38,17,1.65,0.74,2020
655,Netherlands,Eredivisie,(UTR),Gyrano Kerk,24,0,2155,10,7.49,0.33,50,18,2.20,0.79,2020
656,Netherlands,Eredivisie,(AJA),Quincy Promes,18,2,1573,12,9.77,0.59,56,30,3.38,1.81,2020
657,Netherlands,Eredivisie,(PSV),Denzel Dumfries,25,0,2363,7,5.72,0.23,45,14,1.81,0.56,2020
659,Netherlands,Eredivisie,(PSV),Cody Gakpo,14,11,1557,7,4.43,0.27,38,15,2.32,0.92,2020

In [378]:
df=pd.read_csv('Football.csv')

In [379]:
df.isnull().sum()

Country                     0
League                      0
Club                       34
Player Names                0
Matches_Played              0
Substitution                0
Mins                        0
Goals                       0
xG                          0
xG Per Avg Match            0
Shots                       0
OnTarget                    0
Shots Per Avg Match         0
On Target Per Avg Match     0
Year                        0
dtype: int64

In [381]:
df['Club'].value_counts()

Club
(PSG)    14
(BAR)    13
(NAP)    13
(FLA)    11
(ATA)    11
         ..
(LOK)     1
(GAL)     1
(SIV)     1
(CAE)     1
(UTR)     1
Name: count, Length: 179, dtype: int64

In [384]:
df.sample()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
468,Brazil,Campeonato Brasileiro Srie A,(BAH),Gilberto,27,5,2524,14,15.94,0.6,80,31,3.01,1.17,2019

# How to save csv file

In [ ]:
data.to_csv('annual-enterprise-survey-2021-financial-year-provisional-csv.csv',index=False)